##
var x := readreal('Введите x:');
var eps := readreal('Введите esp:');
assert((abs(x) < 1) and (eps in 0..1));
var sum := 0.0;
var el := x;
var i := 1;
 
while abs(el) >= eps do
  begin
  sum += el / i;
  el := -x * x;
  i += 2
  end;
  
assert(abs(sum - arctan(x)) < eps, 'Недостаточно точно!');
print($'Приближенное значение {sum}, точное значение {arctan(x)}')


{
Введите x: 0.3
Введите esp: 0.3
Приближенное значение 0.3, точное значение 0.291456794477867
Введите x: 0.7
Введите esp: 0.2
Приближенное значение 0.7, точное значение 0.610725964389209 
Введите x: 0.4
Введите esp: 0.8
Приближенное значение 0, точное значение 0.380506377112365
Введите x: 0.6
Введите esp: 0.3
Приближенное значение 0.6, точное значение 0.540419500270584 

