##

var n := readinteger('Введите n:');
var k := readinteger('Введите k:');
assert((n > 0) and (k > 0));
var num : real;
var num_temp := 1.0;
println('Введите послеовательность:');

for var i := 1 to n do
    begin
      num := readreal();
      loop k do num_temp *= num;
      println($'A({i}) = {num_temp}');
      num_temp := 1.0
    end;

{
Введите n: 5
Введите k: 2
Введите последовательность:
2.0 3.0 4.0 5.0 6.0
A(1) = 4
A(2) = 9
A(3) = 16
A(4) = 25
A(5) = 36


Введите n: 5
Введите k: 2
Введите послеовательность:
2.0 -3.0 -1.0 -4.0 2.0
A(1) = 4
A(2) = 9
A(3) = 1
A(4) = 16
A(5) = 4

Введите n: 5
Введите k: 3
Введите послеовательность:
2.0 4.0 -4.0 -2.0 -5.0
A(1) = 8
A(2) = 64
A(3) = -64
A(4) = -8
A(5) = -125
}