##
var x := readreal('Введите x:');
var n := readinteger('Введите n:');
assert(n > 0);
var sum := 1.0;
var el := x;
var fact := 1;

for var i := 2 to n + 1 do
begin
  sum += el / fact;
  el *= x / i;
end;
println($'Ответ: Сумма - {sum}, Экспонента - {exp(x)}')




{
Введите x: 1.0
Введите n: 32
Ответ: Сумма - 2.71828182845905, Экспонента - 2.71828182845905
Введите x: -2.5
Введите n: 10
Ответ: Сумма - 0.0825781241926565, Экспонента - 0.0820849986238988
Введите x: 6.66
Введите n: 66
Ответ: Сумма - 780.550937126804, Экспонента - 780.550937126804
}